# Rolling sum salary

Source: https://towardsdatascience.com/twenty-five-sql-practice-exercises-5fc791e24082

The following table shows the monthly salary for an employee for the first nine months in a given year. From this, write a query to return a table that displays, for each month in the first half of the year, the rolling sum of the employeeâ€™s salary for that month and the following two months, ordered chronologically.

In [1]:
%run Question.ipynb

 * postgresql://fknight:***@localhost/postgres
Done.
Done.
9 rows affected.
9 rows affected.

# Part A

Write a query to identify, for each month, the range of 3 months that come after it, including the salary for each month.

## Example answer

In [2]:
%%sql

SELECT s1.month, s2.month, s2.salary
FROM salaries s1
JOIN salaries s2
ON s1.month <= s2.month
AND s1.month > s2.month - 3;

 * postgresql://fknight:***@localhost/postgres
24 rows affected.

[(1, 1, '$2,000.00'),
 (1, 2, '$3,000.00'),
 (1, 3, '$5,000.00'),
 (2, 2, '$3,000.00'),
 (2, 3, '$5,000.00'),
 (2, 4, '$4,000.00'),
 (3, 3, '$5,000.00'),
 (3, 4, '$4,000.00'),
 (3, 5, '$2,000.00'),
 (4, 4, '$4,000.00'),
 (4, 5, '$2,000.00'),
 (4, 6, '$1,000.00'),
 (5, 5, '$2,000.00'),
 (5, 6, '$1,000.00'),
 (5, 7, '$2,000.00'),
 (6, 6, '$1,000.00'),
 (6, 7, '$2,000.00'),
 (6, 8, '$4,000.00'),
 (7, 7, '$2,000.00'),
 (7, 8, '$4,000.00'),
 (7, 9, '$5,000.00'),
 (8, 8, '$4,000.00'),
 (8, 9, '$5,000.00'),
 (9, 9, '$5,000.00')]

# Part B

Modify the query from Part A to limit the months to just the first half of the year.

```sql
SELECT s1.month, s2.month, s2.salary
FROM salaries s1
JOIN salaries s2
ON s1.month <= s2.month
AND s1.month > s2.month - 3;
```

## Example answer

In [3]:
%%sql

SELECT s1.month, s2.month, s2.salary
FROM salaries s1
JOIN salaries s2
ON s1.month <= s2.month
AND s1.month > s2.month - 3
WHERE s1.month < 7
;

 * postgresql://fknight:***@localhost/postgres
18 rows affected.

[(1, 1, '$2,000.00'),
 (1, 2, '$3,000.00'),
 (2, 2, '$3,000.00'),
 (1, 3, '$5,000.00'),
 (2, 3, '$5,000.00'),
 (3, 3, '$5,000.00'),
 (2, 4, '$4,000.00'),
 (3, 4, '$4,000.00'),
 (4, 4, '$4,000.00'),
 (3, 5, '$2,000.00'),
 (4, 5, '$2,000.00'),
 (5, 5, '$2,000.00'),
 (4, 6, '$1,000.00'),
 (5, 6, '$1,000.00'),
 (6, 6, '$1,000.00'),
 (5, 7, '$2,000.00'),
 (6, 7, '$2,000.00'),
 (6, 8, '$4,000.00')]

# Part C

Modify the query from Part B to solve the original problem.

```sql
SELECT s1.month, s2.month, s2.salary
FROM salaries s1
JOIN salaries s2
ON s1.month <= s2.month
AND s1.month > s2.month - 3
WHERE s1.month < 7
```

## Example answer

In [4]:
%%sql

SELECT s1.month, sum(s2.salary)
FROM salaries s1
JOIN salaries s2
ON s1.month <= s2.month
AND s1.month > s2.month - 3
WHERE s1.month < 7
GROUP BY s1.month
ORDER BY s1.month
;

 * postgresql://fknight:***@localhost/postgres
6 rows affected.

[(1, '$10,000.00'),
 (2, '$12,000.00'),
 (3, '$11,000.00'),
 (4, '$7,000.00'),
 (5, '$5,000.00'),
 (6, '$7,000.00')]

## The full solution is given below

In [5]:
%%sql

-- self-join to match month n with months n, n+1, and n+2, then sum
-- salary across those months, filter to first half of year, and sort

SELECT s1.month, sum(s2.salary) AS salary_3mos FROM salaries s1
JOIN salaries s2
ON s1.month <= s2.month
AND s1.month > s2.month - 3 GROUP BY 1
HAVING s1.month < 7
ORDER BY 1 ASC;

 * postgresql://fknight:***@localhost/postgres
6 rows affected.

[(1, '$10,000.00'),
 (2, '$12,000.00'),
 (3, '$11,000.00'),
 (4, '$7,000.00'),
 (5, '$5,000.00'),
 (6, '$7,000.00')]